{
    "class_name": "Functional",
    "config": {
        "name": "model_2",
        "layers": [
            {
                "class_name": "InputLayer",
                "config": {
                    "batch_input_shape": [
                        null,
                        1
                    ],
                    "dtype": "float32",
                    "sparse": false,
                    "ragged": false,
                    "name": "tech_input"
                },
                "name": "tech_input",
                "inbound_nodes": []
            },
            {
                "class_name": "InputLayer",
                "config": {
                    "batch_input_shape": [
                        null,
                        50,
                        5
                    ],
                    "dtype": "float32",
                    "sparse": false,
                    "ragged": false,
                    "name": "lstm_input"
                },
                "name": "lstm_input",
                "inbound_nodes": []
            },
            {
                "class_name": "Dense",
                "config": {
                    "name": "tech_dense_0",
                    "trainable": true,
                    "dtype": "float32",
                    "units": 20,
                    "activation": "linear",
                    "use_bias": true,
                    "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "name": "tech_dense_0",
                "inbound_nodes": [
                    [
                        [
                            "tech_input",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "LSTM",
                "config": {
                    "name": "lstm_0",
                    "trainable": true,
                    "dtype": "float32",
                    "return_sequences": false,
                    "return_state": false,
                    "go_backwards": false,
                    "stateful": false,
                    "unroll": false,
                    "time_major": false,
                    "units": 50,
                    "activation": "tanh",
                    "recurrent_activation": "sigmoid",
                    "use_bias": true,
                    "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                            "seed": null
                        }
                    },
                    "recurrent_initializer": {
                        "class_name": "Orthogonal",
                        "config": {
                            "gain": 1,
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "unit_forget_bias": true,
                    "kernel_regularizer": null,
                    "recurrent_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "recurrent_constraint": null,
                    "bias_constraint": null,
                    "dropout": 0,
                    "recurrent_dropout": 0,
                    "implementation": 2
                },
                "name": "lstm_0",
                "inbound_nodes": [
                    [
                        [
                            "lstm_input",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "Activation",
                "config": {
                    "name": "tech_relu_0",
                    "trainable": true,
                    "dtype": "float32",
                    "activation": "relu"
                },
                "name": "tech_relu_0",
                "inbound_nodes": [
                    [
                        [
                            "tech_dense_0",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "Dropout",
                "config": {
                    "name": "lstm_dropout_0",
                    "trainable": true,
                    "dtype": "float32",
                    "rate": 0.2,
                    "noise_shape": null,
                    "seed": null
                },
                "name": "lstm_dropout_0",
                "inbound_nodes": [
                    [
                        [
                            "lstm_0",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "Dropout",
                "config": {
                    "name": "tech_dropout_0",
                    "trainable": true,
                    "dtype": "float32",
                    "rate": 0.2,
                    "noise_shape": null,
                    "seed": null
                },
                "name": "tech_dropout_0",
                "inbound_nodes": [
                    [
                        [
                            "tech_relu_0",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "Concatenate",
                "config": {
                    "name": "concatenate",
                    "trainable": true,
                    "dtype": "float32",
                    "axis": -1
                },
                "name": "concatenate",
                "inbound_nodes": [
                    [
                        [
                            "lstm_dropout_0",
                            0,
                            0,
                            {}
                        ],
                        [
                            "tech_dropout_0",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "Dense",
                "config": {
                    "name": "dense_pooling",
                    "trainable": true,
                    "dtype": "float32",
                    "units": 64,
                    "activation": "sigmoid",
                    "use_bias": true,
                    "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "name": "dense_pooling",
                "inbound_nodes": [
                    [
                        [
                            "concatenate",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "Dense",
                "config": {
                    "name": "dense_out",
                    "trainable": true,
                    "dtype": "float32",
                    "units": 1,
                    "activation": "linear",
                    "use_bias": true,
                    "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "name": "dense_out",
                "inbound_nodes": [
                    [
                        [
                            "dense_pooling",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            }
        ],
        "input_layers": [
            [
                "lstm_input",
                0,
                0
            ],
            [
                "tech_input",
                0,
                0
            ]
        ],
        "output_layers": [
            [
                "dense_out",
                0,
                0
            ]
        ]
    },
    "keras_version": "2.4.0",
    "backend": "tensorflow"
}